#include <stdio.h>

int main() {
  int num = 0;
  int result = 1; // Початкове значення result - 1 (припускаємо, що число є простим)


    if(num == 0){
    return 0;
    }  //Число 0 не є простим 


  // Перевірка чи є число менше або дорівнює 2
  if (num <= 1) {
    result = 0; // Якщо число менше або дорівнює 1, то воно не є простим



  } else {
    for (int i = 2; i * i <= num; i++) {

      if (num % i == 0) {
        result = 0; // Знайдено дільник, отже число не є простим
        break;
      }
    }
  }
 




  if (result == 1) {
    // число є простим
  }


  else {
    //число не є простим
  }


  return 0;
}
