

/**
 * @file lib.c
 * @brief Функція для додавання нового елементу масиву.
 * @details Функція додає новий елемент до динамічного масиву arr, збільшуючи його розмір на одиницю.
 * @param  arr Вказівник на початок динамічного масиву.
 * @param size Вказівник на змінну, що зберігає поточний розмір масиву.
 * @param element Елемент, який потрібно додати до масиву.
 * @return Вказівник на оновлений масив після додавання нового елементу.
 */

#include "lib.h"

int *append(int *arr, int *size, int element)
{

    (*size)++; 

    arr = (int *)realloc(arr, (size_t)(*size) * sizeof(int));

    *(arr + *size - 1) = element; //Додаємо новий елемент до масиву 

    return arr;
}







