/**


*@file lib.h



*@brief Заголовочний файл, який містить прототипи функції для формування трикутника Паскаля



*/

#ifndef LIB_H

#define LIB_H

#include <stdio.h>

#include <stdlib.h>

/*



*



* @brief Прототип функції для обчислення біноміального коефіцієнта.



*



* @param n Кількість елементів.



* @param k Кількість обраних елементів.



* @return Значення біноміального коефіцієнта.



*/

int binomialCoeff(int n, int k);

/*



* @brief Прототип функції для виведення трикутника Паскаля рекурсивним методом.



*



* @param n Кількість строк трикутника Паскаля.



*/

void printPascalRecursive(int n);

/*



* @brief Прототип функції для виведення трикутника Паскаля ітеративним методом.



*



* @param n Кількість строк трикутника Паскаля.



*/

void printPascalIterative(int n);

#endif

