/***



 * @file main.c



 * @brief  Основна функція програми.



 *



 */

#include <stdio.h>

#include "lib.h"

/**



 * @brief Функція для введення кількості строк та вивід трикутника Паскаля обома методами.



 * @return 0 у випадку успішного завершення програми.



 *



 */

int main()

{

    

    printf("Автор: Микита Іовов\nГрупа: КН-923Б\nТема: Взаємодія з користувачем шляхом механізму введення/виведення\n");

    int rows = 0;

    printf("Введіть кількість строк: ");

    scanf("%d", &rows);

    printf("Трикутник Паскаля ітеративним методом: \n");

    printPascalIterative(rows);

    printf("Трикутник Паскаля рекурсивним методом: \n");

    printPascalRecursive(rows);

    return 0;
}
